export const maps = [
    // 이벤트
    { name: '[이벤트] 슈피겔만 월드 보스 레이드', positions: ['1', '2', '3', '4', '5', '6'] },

    // 빅토리아
    { name: '커닝시티 파티 퀘스트', positions: ['1', '2', '3', '4'] },
    { name: '골렘의 숲', positions: ['4층', '3층', '2층', '1층'] },
    { name: '야시장 사잇길1', positions: ['경심', '좌1', '우1', '우2', '우3', '버블꾼'] },

    // 오르비스
    { name: '오르비스 파티 퀘스트(경파)', positions: ['좌1', '좌2', '좌3', '우1', '우2', '우3'] },
    { name: '오르비스 파티 퀘스트(완파)', positions: ['좌1', '좌2', '좌3', '우1', '우2', '우3'] },

    // 엘나스
    { name: '차가운벌판1', positions: [] },
    { name: '차가운벌판2', positions: [] },
    { name: '차디찬벌판', positions: ['좌3', '좌2', '좌1', '우3', '우2', '우1'] },
    { name: '얼음골짜기1', positions: [] },
    { name: '얼음골짜기2', positions: [] },
    { name: '늑대의영역1', positions: [] },
    { name: '죽은나무의숲1', positions: [] },
    { name: '죽은나무의숲2', positions: ['좌2', '좌1', '우2', '우1'] },
    { name: '죽은나무의숲3', positions: ['좌1', '우2', '우1'] },
    { name: '죽은나무의숲4', positions: ['2층', '1층'] },

    // 루디브리엄
    { name: '루디브리엄 파티 퀘스트', positions: ['1', '2', '3', '4', '5', '6'] },
    { name: '몬스터 카니발(3,4필드)', positions: ['승(기사)', '승(잠수)', '패(기사)', '패(잠수)'] },
    { name: '몬스터 카니발(5,6필드)', positions: ['승(기사)', '승(잠수)', '승(잠수)', '패(기사)', '패(잠수)', '패(잠수)'] },
    { name: '잃어버린시간2', positions: [] },
    { name: '시간의길1', positions: ['5층', '4층', '3층', '2층', '1층'] },
    { name: '시간의길4', positions: ['4,5층', '3층', '2층', '1층'] },
    { name: '삐뚤어진 시간(듀파)', positions: ['5층', '4층', '3층', '2층', '1층', '경심'] },
    { name: '사라진 시간(마데테)', positions: ['5,6층', '4층', '3층', '2층', '1층', '파티장'] },
    { name: '금지된 시간', positions: [] },

    // 마가티아
    { name: '로미오와 줄리엣(로묘파퀘)', positions: ['1', '2', '3', '4'] },

    // 아쿠아리움
    { name: '위험한 바다 협곡1', positions: [] },
    { name: '위험한 바다 협곡2(오징어/원양어선)', positions: ['5층', '4층', '3층', '2층', '1층', '경심'] },
    { name: '깊은 바다 협곡1', positions: [] },
    { name: '깊은 바다 협곡2(망둥)', positions: ['집뿌기사', '고깐', '중깐', '저깐', '프리'] },

    // 리프레
    { name: '마뇽의 숲', positions: ['파티장', '울음1', '울음2', '울음3'] },
    { name: '그리프의 숲', positions: [] },

    { name: '하늘 둥지 입구', positions: ['나무꾼', '로어1', '로어2', '로어3', '경심'] },
    { name: '하늘 둥지2', positions: ['기사', '좌1'] },

    { name: '붉은 켄타우로스의 영역(4인)', positions: ['좌2', '우2', '경심', '1층'] },
    { name: '붉은 켄타우로스의 영역(5인)', positions: ['좌2', '우2', '경심', '좌1', '우1'] },

    { name: '푸른 켄타우로스의 영역', positions: [] },
    { name: '검은 켄타우로스의 영역', positions: [] },

    { name: '불과 어둠의 전장(4인)', positions: ['좌3', '좌기사', '우3', '우기사'] },
    { name: '불과 어둠의 전장(5인)', positions: ['좌3', '좌2', '좌1', '우3', '우1,2'] },
    { name: '불과 어둠의 전장(6인)', positions: ['좌3', '좌3', '좌기사', '우3', '우3', '우기사'] },
    { name: '불과 어둠의 전장(로어)', positions: ['좌3', '우3', '좌용', '우용', '경심'] },

    { name: '물과 어둠의 전장', positions: [] },

    { name: '산양의 골짜기1', positions: ['4층', '3층', '2층', '1층', '경심'] },
    { name: '숲의 갈림길', positions: ['경심', '3층(좌)', '3층(우)', '2층(좌)', '2층(우)', '1층'] },
    { name: '용의 숲 입구', positions: ['좌3', '좌2', '우2', '1층', '경심'] },
    { name: '용의 숲1', positions: [] },

    { name: '불타는 숲(3인)', positions: ['2,3,4층', '좌1(다크)', '우1(그린)'] },
    { name: '불타는 숲(4인)', positions: ['2,3,4층', '좌1(다크)', '우1(그린)', '경심'] },

    { name: '사라진 숲', positions: [] },
    { name: '용의 숲2', positions: [] },
    { name: '용의 숲3', positions: [] },
    { name: '용의 협곡', positions: [] },
    { name: '협곡의 갈림길', positions: [] },

    { name: '협곡의 동쪽길(3인)', positions: ['3,4층', '1,2층', '경심'] },
    { name: '협곡의 동쪽길(4인)', positions: ['옥상', '3층', '1,2층', '경심'] },
    { name: '협곡의 동쪽길(5인)', positions: ['옥상', '3층', '고깐', '저깐', '경심'] },

    { name: '블루 와이번의 둥지(3인)', positions: ['중옥', '바닥', '경심'] },
    { name: '블루 와이번의 둥지(4인)', positions: ['옥상', '중앙', '바닥', '경심'] },
    { name: '블루 와이번의 둥지(5인)', positions: ['옥상', '좌2', '우2', '바닥', '경심'] },

    { name: '협곡의 서쪽길', positions: [] },
    { name: '레드 와이번의 둥지', positions: ['옥상', '2,3층', '1층', '경심'] },
    { name: '와이번의 협곡', positions: [] },
    { name: '용의 둥지 입구', positions: [] },

    { name: '망가진 용의 둥지(4인)', positions: ['옥상', '2층', '1층', '경심'] },
    { name: '망가진 용의 둥지(5인)', positions: ['옥상', '2층', '좌1', '우1', '경심'] },
    { name: '망가진 용의 둥지(6인)', positions: ['옥상', '좌2', '우2', '좌1', '우1', '경심'] },

    { name: '죽은 용의 둥지', positions: ['3층', '1,2층'] },

    { name: '위험한 용의 둥지(4인)', positions: ['옥상', '2층', '1층', '경심'] },
    { name: '위험한 용의 둥지(5인)', positions: ['옥상', '좌2', '우2', '1층', '경심'] },
    { name: '위험한 용의 둥지(6인)', positions: ['옥상', '좌2', '우2', '좌1', '우1', '경심'] },

    { name: '남겨진 용의 둥지1(2인)', positions: ['3,4층', '1,2층'] },
    { name: '남겨진 용의 둥지1(3인)', positions: ['3,4층', '2층', '1층'] },
    { name: '남겨진 용의 둥지1(4인)', positions: ['4층', '3층', '2층', '1층'] },

    { name: '큰 둥지 봉우리', positions: ['2층', '좌1', '중앙', '우1'] }
];
